#####  创建表结构
    create table 表名(
        列名 类型，
        列名 类型，
        列名 类型
     )default charset=utf8;

In [ ]:
create table tb1(    
    id int, 
    name varchar(16)  
      )default charset=utf8;

In [ ]:
create table tb2(
    id int,
    name varchar(16) not null, -- 不允许为空
    email varchar(16) null,  --允许为空(默认)
    age int
)default charset=utf8;

In [ ]:
create table tb3(
    id int,
    name varchar(16) not null, -- 不允许为空
    email varchar(16) null, -- 允许为空(默认)
    age int default 3     -- 插入数据时，如果不给age列设置值，默认值为3
)default charset=utf8;

In [ ]:
create table tb4(
    id int primary key,      -- 主键(不允许为空、不能重复) 一个表只有一个主键
    name varchar(16) not null, -- 不允许为空
    email varchar(16) null, -- 允许为空(默认)
    age int default 3     -- 插入数据时，如果不给age列设置值，默认值为3
)default charset=utf8;

In [ ]:
create table tb5(
    id int not null auto_increment primary key,      -- 主键&不为空&自增
    name varchar(16) not null, -- 不允许为空
    email varchar(16) null, -- 允许为空(默认)
    age int default 3     -- 插入数据时，如果不给age列设置值，默认值为3
)default charset=utf8;

- 查看表 `desc 表名`
- 查询表内容 `select * from 表名;`
- 删除表 `drop table 表名;`
- 清空表 `delete from 表名;`或`truncate table 表名;`(速度快，无法回滚撤销等)
- 修改表
    - 添加列  
    `alter table 表名 add 列名 类型;`  
    `alter table 表名 add 列名 类型 DEFAULT 默认值;`  
    `alter table 表名 add 列名 类型 not null default 默认值;`  
    `alter table 表名 add 列名 类型 not null primary key auto_increment;`
    - 删除列  
    `alter table 表名 drop column 列名；`  
    - 修改列 类型  
    `alter table 表名 modify column 列名 类型;`  
    - 修改列 类型+名称    
    `alter table 表名 change 原列名 新列名 新类型;`  
    `alter table tb change id id int not null;`  
    `alter table tb change id id int not null default 5;`  
    `alter table tb change id id int not null primary key auto_increment;`  
    `alter table tb change id id int ;` -- 允许为空，删除默认值，删除自增  
    - 修改列 默认值  
    ` ALTER TABLE 表名 ALTER 列名 SET DEFAULT 100;`    
    - 删除列 默认值  
    `ALTER TABLR 表名 ALTER 列名 SET DEFAULT;`  
    - 添加主键  
    `alter tablr 表名 add primary key(列名);`  
    - 删除主键  
    `alter table 表名 drop primary key;`

#### 数据行操作

- 新增数据  
`insert into 表名(列名，列名，列名) values(对应列的值，对应列的值，对应列的值);`  
`insert into tb1(name,password) values('xiaoming','1232321');`  
`insert into tb1(name,password) values('xiaoming','1232321'),('alexs','4566321');`   
`insert into tb1 values('xiaoming','1232321'),('alexs','4566321');`--如果表中只有2列
- 删除数据  
`delete from 表名;`  
`delete from 表名 where 条件;`  
`delete from tb1;`  
`delete from tb1 where name='peiqi';`  
`delete from tb1 where name='peiqi' and password='123'; `   
`delete from tb1 where id>9;`  
- 修改数据  
`update 表名 set 列名=值;`   
`update 表名 set 列名=值 where 条件;`  
`select*from info where id between 2 and 4;`  
`update tb1 set name='xiaomin';`    
`update tb1 set name='xiaomin' where id=1;`    
`update tb1 set age=age+1 where id=2;`  
`update users set name=concat(name,'123') where id=2;`  
- 查询数据  
`select * from 表名;`  
`select 列名，列名，列名 from 表名;`  
`select 列名，列名 as 列名，列名 from 表名;`  
`select * from 表名 where 条件;`  
`select * from tb1;`  
`select id,name,age from tb1;`  
`select id,name as N,age from tb1;`  
`select id,name as N,age,111 from tb1;`  
`select * from tb1 where id=1;`  
`select * from tb1 where id>1;`  
`select * from tb1 where id!=1;`  
`select * from tb1 where name='xiaomin' and password='123';`

#### 根据条件搜索结果

select * from tb1 where age>30;
select * from tb1 where id>3;
select * from tb1 where id=3;
select * from tb1 where id>=3;
select * from tb1 where id!=3;
select * from tb1 where id between 2 and 4; --id大于等于2，小于等于4；

select * from tb1 where name="hong" and age=19;
select * from tb1 where name="hong" or age=19;
select * from tb1 where (name="hong" or age=19) and id=1;

select * from tb1 where id in (1,2,3);
select * from tb1 where id not in (1,2,3);
select * from tb1 where id in (select id from tb2);
select * from tb1 where exists (select * from tb2 where id=5);
select * from tb1 where not exists (select * from tb2 where id=5);

#### 通配符
- %表示n个字符
- _表示一个字符

select * from tb1 where name like "%ming%";
select * from tb1 where name like "%ming";
select * from tb1 where name like "ming%";
select * from tb1 where name like "k%y";  

select * from tb1 where email like "_@live.com";
select * from tb1 where email like "_ing@live.com";

#### 映射
- 想要获取的类

select id, name from tb1;
select id, name as NM from tb1;
select id, name as NM,123 from tb1;

select
    id,
    name,
    666 as num,
    (select max(id) from tb2) as mid,
    age
from tb1;

select
    id,
    name,
    (select title from tb2 where tb2.id=tb1.id) as x1
from tb1;

select 
    id,
    name,
    case depart_id when 1 then "第一部门" end v1,
    case depart_id when 1 then "第一部门" else "其他" end v2,
    case depart_id when 1 then "第一部门" when 2 then "第二部门" else "其他" end v3
from tb1;

#### 排序

select * from tb1 order by age desc;  --降序
select * from tb1 order by age asc;  --升序

select * from tb1 order by age asc,id desc; --优先按照age从小到大，如果age相同则按照id从大到小
select * from tb1 where id>6 or name like "%y" order by age asc,id desc;

#### 取部分数据

select * from tb1 limit 5;  --只获取前5行数据
select * from tb1 order by id desc limit 3; --先排序，再获取前3条数据
select * from tb1 where id>9 order by id desc limit 3; --先排序，再获取前3条数据

select * from tb1 limit 3 offset 2; --从数据2开始，向后获取3条数据

#### 分组

select age,max(id),min(id),sum(id),avg(id) from tb1 group by age;
select age,count(1) from tb1 group by age; --按照age进行分组，并计算每个age的人数
select age,count(1) from tb1 group by age having count(age)>2;

#### 左右连表
- 多个表连接起来进行查询

select * from info left outer join depart on info.depart_id=depart.id;